examples/pulsatile_inlet_outlet_bifurcation/constant/polyMesh/boundary
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}

4         
(
    INLET
    {
        type patch;
        nFaces 406;
        startFace 659605;
    }
    OUTLET_1
    {
        type patch;
        nFaces 222;
        startFace 660011;
    }
    OUTLET_2
    {
        type patch;
        nFaces 276;
        startFace 660233;
    }
    WALL
    {
        type wall;
        nFaces 28806;
        startFace 660509;
    }
)
